{
    "data":[{ 
        "title": "Spawn Point",
        "date": "21 - Março - 1991",
        "subtitle":"São Bernardo - SP",
        "text": "Vem ao mundo um bebê! Eu nasci em um dia de primavera, quando o Sol estava brilhando em Aries e a Lua em Gêmeos. Com um ascendente em Leão, desde o primeiro momento eu já mostrava minha paixão por liderança e comunicação. Já como bebê eu era curioso e animado, sempre pronto para explorar o mundo a minha volta e deixar minha marca no mundo. Eu sou um verdadeiro Ariano, sempre buscando novos desafios e aventuras. Com a influência da Lua em Gêmeos, eu sou um comunicador natural e adoro aprender coisas novas. E com o ascendente em Leão, eu sou um líder nato e sempre busco brilhar.",
        "type": "Conquista"
    },{
        "title": "Colégio Hebraico Brasileiro Renascença",
        "subtitle":"Ensino Fundamental",
        "date": "1996 | 1998",
        "text": "Estudar no Colégio Renascença foi uma experiência única. Além do ensino fundamental tradicional, tive a oportunidade de explorar minha criatividade nas aulas de carpintaria, aprender sobre a rica cultura judaica e adquirir habilidades no idioma hebreu. Foi um período de crescimento pessoal e educacional, onde pude desenvolver minhas habilidades e me preparar para o próximo passo em minha jornada acadêmica. Ainda guardo boas lembranças desse tempo e agradeço a todos os professores que me acompanharam nessa jornada.",
        "type": "Formação"
    },{
        "title": "McNab Elementary School",
        "subtitle":"Ensino Fundamental",
        "date": "1998 | 2001",
        "text": "Como imigrante nos Estados Unidos na década de 90, tive a oportunidade de viver e estudar em Pompano Beach, FL. Ao me adaptar ao currículo americano, que incluía esportes tradicionais como Baseball e Football, aulas de programação e espanhol, além do currículo brasileiro, eu pude aprender sobre a verdadeira paixão americana pela sua pátria, o que me transformou em uma pessoa mais patriota e apaixonada pela minha própria terra natal. A experiência de imigração foi fundamental para moldar a minha perspectiva e valorização da minha própria cultura e identidade.",
        "type": "Formação",
        "image":"mcnab.jpg"
    },{
        "title": "Prêmio de melhor desenho",
        "subtitle":"McNab Elementary School",
        "date": "1999",
        "text": "Enquanto estudante em Pompano Beach, tive a honra de representar minha escola e minha comunidade imigrante através de minha arte. Concorri em um campeonato de desenho, onde desenhei a icônica residência presidencial como símbolo da realização do sonho americano. Fui honrado ao ser premiado com o primeiro lugar e a oportunidade de ver meu desenho exibido na Casa Branca. Essa experiência me deu uma profunda apreciação pelo sistema educacional dos Estados Unidos.",
        "type": "Conquista",
        "image":"melhor_desenho-3.jpg"
    },{
        "title": "Colégio VIP",
        "subtitle":"Ensino Fundamental",
        "date": "2003 | 2005",
        "text": "Eu tive a oportunidade de mergulhar na cultura japonesa durante meus anos escolares, escolhendo aprender o idioma japonês em vez de espanhol. Aprendi a ler os caracteres Hiragana e Katakana, o que me permitiu ler livros, revistas e até mesmo alguns mangás em japonês. Além disso, tive a oportunidade de praticar artes marciais, como o judô, e danças tradicionais japonesas, o que me deu uma visão mais profunda e apreciação da cultura japonesa. Aprender sobre a arte da dobradura, o origami, e outras tradições culturais também me permitiu ter uma compreensão mais profunda e respeito pela cultura japonesa. Embora eu não tenha se tornado fluente no idioma, essa experiência me permitiu desenvolver uma paixão pela cultura japonesa e me inspirou a continuar aprendendo e explorando-a.",
        "type": "Formação"
    },{
        "title": "Fundação Escola de Comércio Álvares Penteado F.E.C.A.P.",
        "subtitle":"Ensino Médio Técnico",
        "date": "2005 | 2008",
        "text": "Fiz o colegial técnico em publicidade e propaganda, onde aprendi sobre marketing, design e ferramentas de edição, como Flash, Corel Draw e Photoshop. Além disso, tive a oportunidade de estudar informática, onde me dediquei ao aprendizado de lógica de programação, desenvolvimento em .NET, Visual Studio, Python e SQL. Eu me esforcei para aproveitar ao máximo essas oportunidades, priorizando o estudo dessas matérias técnicas, mesmo que isso significasse sacrificar aulas de disciplinas humanas. Esses conhecimentos continuam a ser fundamentais na minha carreira atual.",
        "type": "Formação"
    },{
        "title": "Campeão de Xadrez",
        "subtitle":"Olimpíadas interescolar anual da F.E.C.A.P.",
        "date": "2007",
        "text": "Eu estava prestes a perder a final, meu oponente já havia anunciado chequemate... mas eu não desisti. Ainda havia uma jogada escondida, minha habilidade e inteligência foram minha arma secreta. Aproveitando a desatenção dele, virei o jogo e venci. O prêmio foi mais do que apenas um troféu e pendrive Kingston 256MB, foi a glória e a honra de ser campeão!",
        "type": "Conquista"
    },{
        "title": "A.I.S. Advanced Informatics School S.A.G.A.",
        "subtitle":"Design Publicitário",
        "date": "Janeiro - 2007 | Julho - 2008",
        "text": "Nesse curso, eu aprendi a dominar as técnicas de composição de vídeos com o Adobe Premiere e a criar efeitos visuais cinematográficos com o Adobe After Effects. Foi uma honra ter tido a oportunidade de trabalhar com meu primeiro gerente, Rogério Felix, o professor que acreditou em mim e me deu a oportunidade de iniciar minha carreira em produções audiovisuais. Com as habilidades adquiridas neste curso, eu estava pronto para alçar voos mais altos e alcançar meus sonhos de sucesso na área de tv, comunicação e cinema.",
        "type": "Formação"
    },{
        "title": "School of Art, Game and Animation S.A.G.A.",
        "subtitle":"Professor assistente",
        "date": "Outubro - 2008 | Julho - 2009",
        "text": "Como membro do time liderado pelo coordenador Rogerio Felix, tive a oportunidade de trabalhar com professores experientes como Caio Hutter Cipó, Danielle Melo e Lucas Silva, na criação do material didático para o curso de desenvolvimento de jogos, agora conhecido como PlayGame na S.A.G.A. Foi meu primeiro emprego e foi uma valiosa experiência de aprendizado onde pude contribuir para o desenvolvimento do curso e adquirir expertise na área.",
        "type": "Emprego"
    },{
        "title": "Apóstrofe - Cenografia e Montagens",
        "subtitle":"Designer de Cenário 3D",
        "date": "Março - 2009 | Janeiro - 2011",
        "text": "Desempenhei um papel importante no design e desenvolvimento de ambientes digitais em 3D para uma variedade de eventos, programas de televisão, shows e stands de shopping. Sob a direção do Arquiteto Responsável Fernando Carvalho Jr., levei minha expertise em design 3D para entregar resultados visualmente impressionantes e impactantes. Projeto F1 - Televisão Globo GDC - Televisão Globo.",
        "type": "Emprego"
    },{
        "title": "Campeão de Judô",
        "subtitle":"Federação Paulista de Judô, Kaikan Tucuruvi - ACET (Associação Cultural e Esportiva de Tucuruvi).",
        "date": "2010",
        "text": "Eu estava prestes a desistir, mas o fogo que arde dentro de mim não permitiu que eu me rendesse. Quando meu nariz foi quebrado na primeira luta, a dor só me inspirou a lutar ainda mais forte. O sangue escorrendo pelo meu rosto não foi nada comparado à força que senti em meu coração. Eu não podia deixar que a dor me vencesse, eu lutei com tanta intensidade na última luta que até hoje me pergunto qual golpe foi o que me deu a vitória. Não há nada mais poderoso do que a determinação de um guerreiro e a minha estava a todo vapor. Não havia como me vencer.",
        "type": "Conquista"
    },{
        "title": "Fundação Escola de Comércio Álvares Penteado F.E.C.A.P.",
        "subtitle":"Professor de Jogos",
        "date": "Janeiro - 2011 | Janeiro - 2013",
        "text": "Eu era responsável por transmitir conhecimento sobre escultura 3D, animação, rigging e programação para jogos digitais para estudantes do ensino médio, desde o primeiro ano até o terceiro ano. Eu ensinei codificação em várias linguagens, como Java, Python, Visual Basic e Actionscript. Trabalhei sob a coordenação de Tania Aguiar e Mario Sergio Zaize.",
        "type": "Emprego"
    },{
        "title": "Colégio Internacional Vocacional Radial",
        "subtitle":"Professor de Jogos",
        "date": "Março - 2011 | Outubro - 2011",
        "text": "Como professor de Ensino Médio Técnico, tive a oportunidade de guiar os alunos pelo incrível mundo da criação de jogos digitais utilizando o software Blender 3D. Desde a modelagem de objetos tridimensionais até a publicação de jogos completos, forneci as habilidades e conhecimentos necessários para que os alunos pudessem se destacar no campo da criação de jogos. Foi gratificante ver os alunos desenvolverem suas habilidades e criarem jogos incríveis, e estou orgulhoso de ter sido parte de sua jornada.",
        "type": "Emprego"
    },{
        "title": "Uma Propaganda",
        "subtitle":"Artista digital freelancer",
        "date": "Maio - 2011 | Agosto - 2011",
        "text": "Eu tive a honra de ser aluno de Alessandro Bender, o melhor professor de marketing que já tive na vida. Sua paixão pelo assunto era contagiante e suas aulas eram sempre incrivelmente enriquecedoras. Foi dele que aprendi a importância da criatividade e inovação no mundo dos negócios. Hoje, ele é o fundador e líder de uma empresa de Endomarketing onde contribuí com a criação de vídeos, sites, animações e artes visuais. Ainda hoje, sigo suas ideias publicadas nas redes sociais e continuo a me inspirar com sua visão e conhecimento. Ele é uma verdadeira referência de homem e professor.",
        "type": "Emprego"
    },{
        "title": "International Game Solutions - IGS",
        "subtitle":"Programador Analista",
        "date": "Março - 2012 | Julho - 2012",
        "text": "Eu fui responsável por dar vida a dois emocionantes jogos de cassino, \"Triple Bonus\" e \"Lucky Note\", usando a poderosa combinação de programação Python e o motor de jogo Blender 3D. Esses jogos foram apresentados em uma feira de jogos na Cidade do México e receberam feedback muito positivo dos participantes.",
        "type": "Emprego",
        "image":"igs-6.jpg"
    },{
        "title": "Agência Rae,MP",
        "subtitle":"Designer de jogos",
        "date": "Julho - 2012 | Setembro - 2012",
        "text": "Desenvolvi um jogo publicitário para o Volkswagen Jetta, utilizando o motor de jogo Blender 3D, que revolucionou a tecnologia web da época. A construção do jogo foi completa, envolvendo modelagem, texturas, animações, programação e mais. Foi uma das primeiras vezes que um jogo foi criado usando HTML5, o que permitiu que ele fosse jogado diretamente no navegador, sem a necessidade de baixar ou instalar qualquer software adicional. Isso foi particularmente inovador em 2012, quando a tecnologia ainda estava se desenvolvendo e a maioria dos jogos online ainda eram baseados em Flash.",
        "type": "Emprego"
    },{
        "title": "Virtuale Comunicação",
        "subtitle":"Programador Web Pleno",
        "date": "Janeiro - 2013 | Outubro - 2014",
        "text": "Como parte de uma empresa de publicidade especializada em endomarketing para empresas farmacêuticas, sou especialista em desenvolvimento de aplicativos multiplataforma usando HTML5, CSS e Javascript para promoção de produtos, software de administração para conferências médicas e fornecimento de serviços de edição de vídeo, animação e artes visuais. Trabalhei de perto com o GP Claudio Corvello e Silva e o CEO Pérsio Marcondes do Amaral para entregar soluções eficazes e inovadoras para nossos clientes. Projeto Clinique Virtuale Web Portfolio.",
        "type": "Emprego",
        "url":"https://virtualeapps.web.app/"
    },{
        "title": "Centro Universitário FMU | FIAM-FAAM",
        "subtitle":"Ciências da Computação",
        "date": "Fevereiro - 2011 | Outubro - 2014",
        "text": "Meu projeto de iniciação científica na FMU, enfocava no desenvolvimento de inteligência artificial para grupos de NPC's usando a abordagem autopoiética. Utilizei conceitos de Varela e Maturana, Turing e Rabin, para construir um método para criar NPC's comparáveis a comportamentos autopoiéticos em um ambiente digital, usando o software Blender e a linguagem Python. O objetivo era auxiliar o desenvolvimento de inteligência artificial para jogos digitais e estudo comportamental de grupos dos seres vivos.",
        "type": "Formação",
        "video":"PyVWa4rkqnI",
        "image":"fmu-13.jpg",
        "url":"portal.fmu.br/cursos/graduacao/ciencia-da-computacao/"
    },{
        "title": "Vancouver Film School V.F.S.",
        "subtitle":"Video Game Art and Development",
        "date": "Agosto - 2014 | Dezembro - 2014",
        "text": "Frequentei um curso na VFS, em Vancouver, no Canadá, onde realizei um sonho de estudar Design de Jogos e aprofundei meus conhecimentos em Unity, Unreal Engine e como funciona o mercado de jogos digitais. Tive o desafio de criar jogos de tabuleiro, além de participar em Game Jams (Hat Jam), onde aprendi a fazer meu melhor o mais rápido possível. Utilizei C#, técnicas de POO e desenvolvi aplicativos mobile para iOS e Android. Trabalhei com o engine de jogo Unreal e Unity 3D e colaborei com amigos em jogos e projetos. Criamos um jogo de qualidade comercial como portfólio, enquanto aprimorávamos nosso entendimento sobre o que é necessário para fazer um game AAA.",
        "type": "Formação",
        "video":"YAfvWdQ55Fc",
        "image":"vfs-5.jpg",
        "url":"vfs.edu/programs/programming"
    },{
        "title": "Elpis The Game",
        "subtitle":"Desenvolvedor",
        "date": "Setembro - 2009 | Julho - 2016",
        "text": "Este projeto de jogo, lançado em 2009, segue a história da criação do universo, onde luz, magia e escuridão se colidem para criar estrelas, elementos e átomos. O jogo oferece uma experiência imersiva e envolvente para os jogadores, com elementos de ação, aventura e fantasia e foi desenvolvido utilizando as ferramentas Blender, Scultris, Photoshop e Python. Até hoje, ele é um dos projetos mais visualizados no site blenderartists.org. O jogador irá se tornar um guardião dos elementos da natureza e terá que viver em três dimensões diferentes.",
        "type": "Projeto",
        "image":"elpis-12.jpg",
        "video":"RxjQfvImJuM",
        "url":"blenderartists.org/t/elpis-the-game-infinite-procedural-terrain-video/466325/491"
    },{
        "title": "Galpão Base & ZOOMB",
        "subtitle":"Designer Programador Sênior",
        "date": "Fevereiro - 2016 | Outubro - 2016",
        "text": "Tive a oportunidade de colaborar com o arquiteto Leo Ceolin e o especialista em interatividade Rodrigo Barbosa, onde desenvolvemos projetos inovadores de exposições com instalações interativas de video mapping. Como desenvolvedor, fui responsável pelo desenvolvimento de aplicativos 3D em tempo real utilizando tecnologias de captura de movimento e voz para aprimorar a experiência dos visitantes. Projetos como o British Invasion (Cultura Inglesa) e Tour Virtual da Amazônia (GreenPeace), foram oportunidades valiosas para contribuir com a criação de experiências imersivas e impactantes para os visitantes.",
        "type": "Emprego",
        "url": "www.behance.net/gallery/111385517/British-Invasion-Experience",
        "video": "t3XiMz6tQ7c",
        "image": "british-12.jpg"
    },{
        "title": "Nyco Tattoo",
        "subtitle":"Tatuador autônomo",
        "date": "Novembro - 2016 | Dezembro - 2020",
        "text": "Sempre amei desenhar, e a tatuagem é o cume da minha paixão pela arte. Representar uma imagem na pele de um cliente é uma honra e um processo transformador, tanto para mim como para meus clientes. A tatuagem é uma forma de expressão única e poderosa que me permite criar algo duradouro e significativo. É um privilégio poder ser parte desse processo e ajudar meus clientes a se expressarem através da arte da tatuagem.",
        "type": "Emprego",
        "url": "www.instagram.com/nycotattoo",
        "image": "tattoos-11.jpg"
    },{
        "title": "Wizard by Pearson",
        "subtitle":"Instrutor de Idiomas Nível 3",
        "date": "Fevereiro - 2021 | Março - 2021",
        "text": "Ser professor de Inglês na Wizard foi uma experiência emocionante e gratificante. Como professor eu me esforcei para fornecer uma educação dinâmica e envolvente, utilizando métodos de ensino como Kahoot, técnicas baseadas em projetos e trabalhos em grupo e feedback personalizado para ajudar meus alunos a desenvolverem suas habilidades de comunicação. Eu sou e serei grato por ter tido a oportunidade de fazer parte desse processo e contribuir para o sucesso dos meus alunos.",
        "type": "Emprego",
        "image":"wizard-7.jpg"
    },{
        "title": "Pai pela primeira vez",
        "subtitle":"Piracicaba - SP",
        "date": "03 - Junho - 2021",
        "text": "Ser pai da minha princesa Helena é uma experiência indescritível, desde o primeiro momento em que a segurei em meus braços, meu mundo inteiro mudou. É uma honra ser o guia dela nessa jornada, ensinando-a a ser forte, bondosa e corajosa. Eu prometo sempre estar lá para ela, seja para uma risada ou uma lágrima, para um abraço ou uma conversa. Ela é a minha razão de viver, meu tesouro mais precioso. Eu sou imensamente grato por ela, por sua existência e por toda a alegria e amor que ela traz para minha vida.",
        "type": "Conquista",
        "image":"nenena-1.jpg"
    },{
        "title": "Canvas Terminal",
        "subtitle":"Desenvolvedor Arquiteto",
        "date": "Outubro - 2021 | Março - 2022",
        "text": "O objetivo desse projeto foi desenvolver um webapp que permite a criação de novos aplicativos e jogos, tanto 2D quanto 3D, utilizando uma engine de jogos construída com HTML5 Canvas, Javascript e Three.js. O sistema é capaz de criar novos aplicativos e jogos, e fornece metodos avançados, para integração com Firebase e todos seus recursos de armazenamento e analize de dados.",
        "type": "Projeto",
        "url":"canvasterminal.web.app",
        "image":"canvasterminal.jpg"
    },{
        "title": "DeepLearning.AI",
        "subtitle":"Natural Language Processing in TensorFlow & Python",
        "date": "Março - 2022",
        "text": "Eu completei um curso sobre Processamento de Linguagem Natural (NLP) usando TensorFlow e Python com o instrutor Laurence Moroney. Eu aprendi sobre tokenização, uso das APIs Tokenizer e pad_sequences, e como preparar e codificar texto para treinar redes neurais. Também mergulhei em diferentes formatos de modelos para entender o contexto em sequência e usei meu conhecimento para previsão, construindo um gerador de poesia. No geral, este curso me permitiu adquirir uma compreensão profunda de NLP e desenvolver minhas habilidades no treinamento de redes neurais para análise de sentimento e geração de texto.",
        "type": "Formação",
        "url":"coursera.org/share/b0b0adf470ebe415b170d581787349b9",
        "image":"tensorflow.jpeg"
    },{
        "title": "Pokédex 3D",
        "subtitle":"Desenvolvedor / Artista",
        "date": "Maio - 2022",
        "text": "Este projeto visava criar uma integração entre uma API REST (PokeAPI), um modelo 3D e HTML Canvas em um webapp responsivo utilizando Three.js para renderização do modelo 3D. A finalidade era atender aos fãs de Pokémon, permitindo que vocês possam reviver a nostalgia e relembrar os melhores 151 monstrinhos de uma forma incrível e divertida!",
        "type": "Projeto",
        "url":"pokedex-nyco3d.web.app",
        "image":"pokedex-6.jpg"
    },{
        "title": "Nyco3D.com",
        "subtitle":"Desenvolvedor",
        "date": "Junho - 2021 | Presente",
        "text": "Sou um desenvolvedor full-stack altamente qualificado e experiente, especializado em tecnologias como React.js, Node.js, Next.js e Firebase. Possuo um histórico comprovado de entrega de projetos de alta qualidade, desde websites, aplicativos web, lojas virtuais, páginas de destino e outros, para uma ampla gama de clientes, incluindo empresas e indivíduos. Tenho habilidade comprovada na construção de APIs robustas e escaláveis e possuo uma profunda compreensão sobre como utilizar as ferramentas do Firebase para desenvolver aplicações web eficientes e seguras.",
        "type": "Projeto",
        "image":"nyco3d-1.jpg",
        "url":"nyco3d.com",
        "video": "sBSvXqvhnXI"
    },{
        "title": "Pilar Papeis",
        "subtitle":"Desenvolvedor Fullstack Freelancer",
        "date": "Abril - 2022 | Presente",
        "text": "O objetivo era desenvolver um sistema que poderia ler uma consulta SQL server e, com base no resultado, criar uma API. A stack principal usa Node.js para o Backend, React para o Frontend e Firebase para os serviços. O tempo estimado para o desenvolvimento foi de 40 horas. O sistema é capaz de se conectar a qualquer banco de dados SQL, criar consultas enviando variáveis, gerarar um link URL para usar como API REST e, por fim, receber os dados em formato JSON para uso em diversas aplicações.",
        "type": "Emprego",
        "image":"pilarpapeis-14.jpg",
        "url":"pilarpapeisrest.web.app"
    }]
}