{
    "data":[{ 
        "title": "Spawn Point",
        "date": "21 - March - 1991",
        "subtitle":"São Bernardo - SP",
        "text": "A precious baby comes into the world! I was born on a sunny spring day, under the radiant sign of Aries and with the Moon in Gemini. With a Leo rising, I displayed my passion for leadership and communication right from the very beginning. Even as a baby, I was inquisitive and full of excitement, always eager to explore the world around me and make my mark. I'm a true Aries, always seeking new challenges and adventures. Influenced by the Moon in Gemini, I'm a natural communicator and thrive on learning new things. And with Leo as my rising sign, I'm a born leader, always striving to shine brightly.",
        "type": "Achievement"
    },{
        "title": "Colégio Hebraico Brasileiro Renascença",
        "subtitle":"Ensino Fundamental",
        "date": "1996 | 1998",
        "text": "Studying at Renascença School was an unparalleled experience. Beyond the traditional elementary education, I had the chance to unleash my creativity in woodworking classes, delve into the rich Jewish culture, and acquire proficiency in the Hebrew language. It was a time of personal and educational growth, where I could nurture my skills and prepare myself for the next chapter in my academic journey. Fond memories of that time still linger, and I'm grateful to all the teachers who guided me on this remarkable journey.",
        "type": "Education"
    },{
        "title": "McNab Elementary School",
        "subtitle":"Ensino Fundamental",
        "date": "1998 | 2001",
        "text": "As an immigrant in the United States in the 1990s, I had the incredible opportunity to live and study in Pompano Beach, FL. As I adapted to the American curriculum, which included traditional sports like baseball and football, programming classes, and Spanish lessons, in addition to the Brazilian curriculum, I had the chance to discover the true American passion for their homeland. This experience transformed me into a more patriotic and passionate person about my own homeland. The immigration experience was pivotal in shaping my perspective and deepening my appreciation for my own culture and identity.",
        "type": "Education",
        "image":"mcnab.jpg"
    },{
        "title": "Prêmio de melhor desenho",
        "subtitle":"McNab Elementary School",
        "date": "1999",
        "text": "While I was a student in Pompano Beach, I had the privilege of representing my school and my immigrant community through my art. I competed in a drawing championship where I depicted the iconic presidential residence as a symbol of the American dream. I was deeply honored to receive first place and the opportunity to have my artwork showcased at the White House. This experience instilled in me a profound appreciation for the educational system in the United States.",
        "type": "Achievement",
        "image":"melhor_desenho-3.jpg"
    },{
        "title": "Colégio VIP",
        "subtitle":"Ensino Fundamental",
        "date": "2003 | 2005",
        "text": "I had the opportunity to immerse myself in Japanese culture during my school years, choosing to learn the Japanese language instead of Spanish. I learned to read Hiragana and Katakana characters, which allowed me to enjoy books, magazines, and even some manga in Japanese. Furthermore, I had the chance to practice martial arts, such as judo, and traditional Japanese dances, which gave me a deeper insight and appreciation for Japanese culture. Learning about the art of origami and other cultural traditions also enabled me to gain a profound understanding and respect for Japanese culture. Although I didn't become fluent in the language, this experience ignited a passion for Japanese culture within me and inspired me to keep learning and exploring it.",
        "type": "Education"
    },{
        "title": "Fundação Escola de Comércio Álvares Penteado F.E.C.A.P.",
        "subtitle":"Ensino Médio Técnico",
        "date": "2005 | 2008",
        "text": "I completed my technical high school in advertising and marketing, where I immersed myself in the worlds of marketing, design, and editing tools such as Flash, Corel Draw, and Photoshop. Additionally, I seized the opportunity to study computer science, dedicating myself to mastering programming logic, .NET development, Visual Studio, Python, and SQL. I was determined to make the most of these opportunities, prioritizing my studies in these technical subjects, even if it meant sacrificing some humanities classes. These skills remain essential in my current career.",
        "type": "Education"
    },{
        "title": "Campeão de Xadrez",
        "subtitle":"Olimpíadas interescolar anual da F.E.C.A.P.",
        "date": "2007",
        "text": "I was on the verge of losing the final, my opponent had already declared checkmate... but I didn't give up. There was still a hidden move, and my skill and intelligence were my secret weapons. Seizing his momentary lapse in attention, I turned the game around and emerged victorious. The prize was more than just a trophy and a Kingston 256MB flash drive; it was the glory and honor of becoming a champion!",
        "type": "Achievement"
    },{
        "title": "A.I.S. Advanced Informatics School S.A.G.A.",
        "subtitle":"Design Publicitário",
        "date": "January - 2007 | July - 2008",
        "text": "In this course, I learned to master video composition techniques with Adobe Premiere and create captivating cinematic visual effects with Adobe After Effects. It was an incredible privilege to work under my first mentor, Rogério Felix, the teacher who believed in me and provided me with the opportunity to kickstart my career in audiovisual production. Armed with the skills acquired in this course, I was ready to soar to greater heights and pursue my dreams of success in the fields of television, communication, and cinema.",
        "type": "Education"
    },{
        "title": "School of Art, Game and Animation S.A.G.A.",
        "subtitle":"Professor assistente",
        "date": "October - 2008 | July - 2009",
        "text": "As a member of the team led by Coordinator Rogerio Felix, I had the exciting opportunity to collaborate with experienced educators such as Caio Hutter Cipó, Danielle Melo, and Lucas Silva in crafting educational materials for the game development course, now renowned as PlayGame at S.A.G.A. It marked my inaugural job experience and proved to be an invaluable learning journey where I was able to actively shape the course's development while gaining expertise in the field.",
        "type": "Job"
    },{
        "title": "Apóstrofe - Cenografia e Montagens",
        "subtitle":"Designer de Cenário 3D",
        "date": "March - 2009 | January - 2011",
        "text": "I played a significant role in the design and development of 3D digital environments for a variety of events, television programs, shows, and shopping mall displays. Under the guidance of the Lead Architect, Fernando Carvalho Jr., I brought my expertise in 3D design to deliver visually stunning and impactful results. Projects: F1 - Globo Television, GDC - Globo Television.",
        "type": "Job"
    },{
        "title": "Campeão de Judô",
        "subtitle":"Federação Paulista de Judô, Kaikan Tucuruvi - ACET (Associação Cultural e Esportiva de Tucuruvi).",
        "date": "2010",
        "text": "I was about to give up, but the fire burning within me didn't allow me to surrender. When my nose was broken in the first fight, the pain only inspired me to fight even harder. The blood running down my face was nothing compared to the strength I felt in my heart. I couldn't let the pain get the better of me, I fought so hard in the last fight that to this day I wonder which blow it was that gave me the victory. There is nothing more powerful than the determination of a warrior and mine was in full swing. There was no way I could lose.",
        "type": "Achievement"
    },{
        "title": "Fundação Escola de Comércio Álvares Penteado F.E.C.A.P.",
        "subtitle":"Game Design Teacher",
        "date": "January - 2011 | January - 2013",
        "text": "I was responsible for imparting knowledge in 3D sculpture, animation, rigging, and game programming to high school students, spanning from the first year to the third year. I taught coding in various languages such as Java, Python, Visual Basic, and Actionscript. I worked under the guidance of Tania Aguiar and Mario Sergio Zaize, contributing to the exciting world of digital creativity and education.",
        "type": "Job"
    },{
        "title": "Colégio Internacional Vocacional Radial",
        "subtitle":"Game Design Teacher",
        "date": "March - 2011 | October - 2011",
        "text": "As a High School Technical Education teacher, I've had the privilege of guiding students through the amazing realm of digital game development using Blender 3D software. From crafting three-dimensional objects to publishing complete games, I've equipped them with the essential skills and knowledge to excel in the field of game creation. It has been truly rewarding to witness these students hone their abilities and craft incredible games, and I take great pride in having been a part of their journey.",
        "type": "Job"
    },{
        "title": "Uma Propaganda",
        "subtitle":"Artista digital freelancer",
        "date": "May - 2011 | August - 2011",
        "text": "I had the honor of being a student of Alessandro Bender, the best marketing professor I've ever had in my life. His passion for the subject was infectious, and his classes were always incredibly enriching. It was from him that I learned the importance of creativity and innovation in the business world. Today, he is the founder and leader of an Endomarketing company where I contribute to the creation of videos, websites, animations, and visual arts. To this day, I continue to follow his ideas on social media and am continually inspired by his vision and knowledge. He is a true role model as both a man and a professor.",
        "type": "Job"
    },{
        "title": "International Game Solutions - IGS",
        "subtitle":"Programador Analista",
        "date": "March - 2012 | July - 2012",
        "text": "I was responsible for bringing to life two thrilling casino games, \"Triple Bonus\" and \"Lucky Note,\" using the powerful combination of Python programming and the Blender 3D game engine. These games were showcased at a gaming expo in Mexico City and received overwhelmingly positive feedback from attendees.",
        "type": "Job",
        "image":"igs-6.jpg"
    },{
        "title": "Agência Rae,MP",
        "subtitle":"Game Designer",
        "date": "July - 2012 | September - 2012",
        "text": "I developed an engaging promotional game for the Volkswagen Jetta, utilizing the Blender 3D game engine, which truly transformed web technology at the time. The game's creation was comprehensive, involving modeling, textures, animations, programming, and more. It marked one of the earliest instances of a game being crafted using HTML5, enabling it to be played directly in the web browser, eliminating the need to download or install any additional software. This was especially groundbreaking in 2012, a period when technology was still evolving, and most online games were still reliant on Flash.",
        "type": "Job",
		"video":"e0oIw7AD0vQ"
    },{
        "title": "Virtuale Comunicação",
        "subtitle":"Programador Web Pleno",
        "date": "January - 2013 | October - 2014",
        "text": "As part of an advertising company specializing in internal marketing for pharmaceutical companies, I am an expert in developing cross-platform applications using HTML5, CSS, and Javascript to promote products, create software for medical conferences, and provide video editing, animation, and visual arts services. I have collaborated closely with GP Claudio Corvello e Silva and CEO Pérsio Marcondes do Amaral to deliver effective and innovative solutions to our clients. Check out our Project Clinique Virtuale Web Portfolio for a glimpse of our work.",
        "type": "Job",
		"video":"s-K7Q1J92TQ",
        "url":"https://virtualeapps.web.app/"
    },{
        "title": "Centro Universitário FMU | FIAM-FAAM",
        "subtitle":"Ciências da Computação",
        "date": "Febuary - 2011 | October - 2014",
        "text": "My undergraduate research project at FMU focused on the development of artificial intelligence for NPC groups using the autopoietic approach. I drew upon concepts from Varela, Maturana, Turing, and Rabin to craft a method for creating NPCs that exhibit autopoietic behaviors in a digital environment. This involved utilizing the Blender software and Python programming language. The ultimate aim was to contribute to the advancement of artificial intelligence in digital gaming and the study of behavioral dynamics within living entities.",
        "type": "Education",
        "video":"PyVWa4rkqnI",
        "image":"fmu-13.jpg",
        "url":"portal.fmu.br/cursos/graduacao/ciencia-da-computacao/"
    },{
        "title": "Vancouver Film School V.F.S.",
        "subtitle":"Video Game Art and Development",
        "date": "August - 2014 | December - 2014",
        "text": "I attended a course at VFS in Vancouver, Canada, where I fulfilled a dream of studying Game Design and deepened my knowledge in Unity, Unreal Engine, and how the digital game market operates. I faced the challenge of creating board games and took part in Game Jams (like Hat Jam), where I learned to give my best as quickly as possible. I utilized C#, object-oriented programming techniques, and developed mobile applications for iOS and Android. I worked with the Unreal game engine and Unity 3D, collaborating with friends on games and projects. Together, we crafted a commercially viable game as part of our portfolio, all while enhancing our understanding of what it takes to create a AAA game.",
        "type": "Education",
        "video":"YAfvWdQ55Fc",
        "image":"vfs-5.jpg",
        "url":"vfs.edu/programs/programming"
    },{
        "title": "Elpis The Game",
        "subtitle":"Developer",
        "date": "September - 2009 | July - 2016",
        "text": "This game project, launched in 2009, follows the story of the creation of the universe, where light, magic, and darkness collide to give birth to stars, elements, and atoms. The game offers an immersive and captivating experience for players, featuring elements of action, adventure, and fantasy. It was developed using tools like Blender, Sculptris, Photoshop, and Python. To this day, it remains one of the most viewed projects on the blenderartists.org website. Players will step into the role of a guardian of the forces of nature and will have to navigate three different dimensions. Explore the depths of creation and embark on an epic journey like no other!",
        "type": "Project",
        "image":"elpis-12.jpg",
        "video":"RxjQfvImJuM",
        "url":"blenderartists.org/t/elpis-the-game-infinite-procedural-terrain-video/466325/491"
    },{
        "title": "Galpão Base & ZOOMB",
        "subtitle":"Designer Programador Sênior",
        "date": "Febuary - 2016 | October - 2016",
        "text": "I had the opportunity to collaborate with architect Leo Ceolin and interactivity specialist Rodrigo Barbosa, where we crafted groundbreaking exhibition projects featuring interactive video mapping installations. As a developer, my role entailed creating real-time 3D applications utilizing motion capture and voice technologies to enhance the visitor experience. Projects like 'British Invasion' (Cultura Inglesa) and the 'Amazon Virtual Tour' (GreenPeace) provided valuable opportunities to contribute to the creation of immersive and impactful experiences for visitors.",
        "type": "Job",
        "url": "www.behance.net/gallery/111385517/British-Invasion-Experience",
        "video": "t3XiMz6tQ7c",
        "image": "british-12.jpg"
    },{
        "title": "Nyco Tattoo",
        "subtitle":"Tatuador autônomo",
        "date": "Novembro - 2016 | December - 2020",
        "text": "I have always loved drawing, and tattooing is the pinnacle of my passion for art. Bringing an image to life on a client's skin is both an honor and a transformative process, for both me and my clients. Tattooing is a unique and powerful form of expression that allows me to create something lasting and meaningful. It's a privilege to be a part of this journey and to help my clients express themselves through the art of tattooing.",
        "type": "Job",
        "url": "https://tlinky.web.app/",
        "image": "tattoos-11.jpg"
    },{
        "title": "Wizard by Pearson",
        "subtitle":"Instrutor de Idiomas Nível 3",
        "date": "Febuary - 2021 | March - 2021",
        "text": "Being an English teacher at Wizard has been an exhilarating and rewarding experience. As a teacher, I dedicated myself to providing a dynamic and engaging education, utilizing teaching methods like Kahoot, project-based techniques, and group work, along with personalized feedback to assist my students in developing their communication skills. I am, and will continue to be, deeply thankful for having had the opportunity to be a part of this journey and contribute to my students' success.",
        "type": "Job",
        "image":"wizard-7.jpg"
    },{
        "title": "Father for the first time",
        "subtitle":"Piracicaba - SP",
        "date": "03 - June - 2021",
        "text": "Being the father of my princess Helena is an indescribable experience. From the very first moment I held her in my arms, my entire world changed. It is a profound honor to be her guide on this journey, teaching her to be strong, kind, and courageous. I promise to always be there for her, whether it's for a laugh or a tear, for a hug or a conversation. She is my reason for living, my most precious treasure. I am immensely grateful for her, for her existence, and for all the joy and love she brings into my life.",
        "type": "Achievement",
        "image":"nenena-1.jpg"
    },{
        "title": "Canvas Terminal",
        "subtitle":"Developer Arquiteto",
        "date": "October - 2021 | March - 2022",
        "text": "The aim of this project was to create a web application that enables the easy development of new 2D and 3D apps and games. We achieved this by utilizing a game engine built with HTML5 Canvas, JavaScript, and Three.js. Our system empowers users to effortlessly craft fresh applications and games while also offering advanced methods for seamless integration with Firebase, unlocking the full potential of its storage and data analysis capabilities.",
        "type": "Project",
        "url":"canvasterminal.web.app",
        "image":"canvasterminal.jpg"
    },{
        "title": "DeepLearning.AI",
        "subtitle":"Natural Language Processing in TensorFlow & Python",
        "date": "March - 2022",
        "text": "I completed a course on Natural Language Processing (NLP) using TensorFlow and Python with instructor Laurence Moroney. Throughout the course, I delved into various aspects of NLP, including tokenization, the use of Tokenizer APIs, and pad_sequences. I also learned how to prepare and encode text for training neural networks. Additionally, I explored different model formats to grasp the sequential context and applied my knowledge to prediction tasks, culminating in the creation of a poetry generator. In summary, this course provided me with a profound understanding of NLP and allowed me to enhance my skills in training neural networks for sentiment analysis and text generation.",
        "type": "Education",
        "url":"coursera.org/share/b0b0adf470ebe415b170d581787349b9",
        "image":"tensorflow.jpeg"
    },{
        "title": "Pokédex 3D",
        "subtitle":"Developer / Artista",
        "date": "May - 2022",
        "text": "This project aimed to create a seamless integration between a REST API (PokeAPI), a 3D model, and an HTML Canvas within a responsive web app using Three.js for 3D model rendering. The goal was to cater to Pokémon fans, enabling you to relive the nostalgia and reminisce about the fantastic 151 creatures in an incredible and enjoyable way!",
        "type": "Project",
        "url":"pokedex-nyco3d.web.app",
        "image":"pokedex-6.jpg"
    },{
        "title": "Pilar Papeis",
        "subtitle":"Developer Fullstack Freelancer",
        "date": "April - 2022 | Present",
        "text": "The goal was to create a system that could read a SQL Server query and, based on the results, generate an API. The core technology stack includes Node.js for the backend, React for the frontend, and Firebase for additional services. We estimated a development time of 40 hours. This system has the capability to connect to any SQL database, generate queries using variables, produce a URL link to serve as a RESTful API, and ultimately receive data in JSON format for versatile application purposes.",
        "type": "Job",
        "image":"pilarpapeis-14.jpg",
        "url":"pilarpapeisrest.web.app"
    },{
        "title": "My Works 3D",
        "subtitle":"Developer",
        "date": "June - 2021 | Present",
        "text": "I am a skilled and experienced full-stack developer specializing in React.js, Node.js, Next.js, and Firebase technologies. I have a proven track record of delivering high-quality, responsive and user-friendly websites, webapps, storefronts, landing pages and other projects for a wide range of clients, including companies and individuals. I am proficient in building robust and scalable APIs and have a deep understanding of how to leverage Firebase to build efficient and secure web applications.",
        "type": "Job",
        "image":"nyco3d-1.jpg",
        "url":"my-works-3d.web.app",
        "video": "ksSTjMNYlLM"
    },{
        "title": "Imaginy AI",
        "subtitle":"Fullstack Developer - CEO",
        "date": "June - 2023 | Present",
        "text": "A platform to create, edit, and host your art and designs all in one place. An AI-powered app crafted for contemporary marketing and design. Craft stunning visuals effortlessly using natural language, so you never have to worry about which prompts to use. Write or speak as if you're having a chat with a friend, an artist, or a salesperson. Unleash the inner art director within you.",
        "type": "Project",
        "url":"imaginy.web.app",
        "image":"imaginy-5.png"
    }]
}